rule compress_data_and_lock_with_password_for_exfiltration_with_winzip {
    meta:
        description = "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party utilities"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"
        mitre = "attack.collection, attack.t1560.001"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ($event.target.process.command_line = /winzip\.exe|winzip64\.exe/ nocase and
        $event.target.process.command_line = /-s"/ nocase and
        $event.target.process.command_line = / -min | -a / nocase)
    condition:
        $event
}
