rule suspicious_execution_of_powershell_with_base64 {
    meta:
        description = "Commandline to launch powershell with a base64 payload"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-20---powershell-invoke-known-malicious-cmdlets, https://unit42.paloaltonetworks.com/unit42-pulling-back-the-curtains-on-encodedcommand-powershell-attacks/, https://mikefrobbins.com/2017/06/15/simple-obfuscation-with-powershell-using-base64-encoding/"
        mitre = "attack.execution, attack.t1059.001"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ($event.target.process.file.full_path = /\\powershell\.exe|\\pwsh\.exe/ nocase and
        $event.target.process.command_line = / -e | -en | -enc | -enco| -ec / nocase and
        ($event.target.process.command_line != / -Encoding / nocase or
        ($event.principal.process.file.full_path != /C:\\Packages\\Plugins\\Microsoft\.GuestConfiguration\.ConfigurationforWindows\\/ nocase and
        $event.principal.process.file.full_path != /\\gc_worker\.exe/ nocase)))
    condition:
        $event
}
