rule remotefxvgpudisablement_abuse_via_atomictestharnesses {
    meta:
        description = "Detects calls to the AtomicTestHarnesses 'Invoke-ATHRemoteFXvGPUDisablementCommand' which is designed to abuse the 'RemoteFXvGPUDisablement.exe' binary to run custom PowerShell code via module load-order hijacking."
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md, https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1"
        mitre = "attack.defense-evasion, attack.t1218"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ($event.target.process.command_line = /Invoke-ATHRemoteFXvGPUDisablementCommand|Invoke-ATHRemoteFXvGPUDisableme/ nocase)
    condition:
        $event
}
