rule suspicious_eventlog_clearing_or_configuration_change_activity {
    meta:
        description = "Detects the clearing or configuration tampering of EventLog using utilities such as "wevtutil", "powershell" and "wmic".
This technique were seen used by threat actors and ransomware strains in order to evade defenses.
"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.001/T1070.001.md, https://eqllib.readthedocs.io/en/latest/analytics/5b223758-07d6-4100-9e11-238cfdd0fe97.html, https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil, https://gist.github.com/fovtran/ac0624983c7722e80a8f5a4babb170ee, https://jdhnet.wordpress.com/2017/12/19/changing-the-location-of-the-windows-event-logs/"
        mitre = "attack.defense-evasion, attack.t1070.001, attack.t1562.002, car.2016-04-002"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ((($event.target.process.file.full_path = /\\wevtutil\.exe$/ nocase and
        $event.target.process.command_line = /clear-log | cl |set-log | sl |lfn:/ nocase) or
        ($event.target.process.file.full_path = /\\powershell\.exe|\\pwsh\.exe/ nocase and
        $event.target.process.command_line = /Clear-EventLog |Remove-EventLog |Limit-EventLog |Clear-WinEvent / nocase) or
        ($event.target.process.file.full_path = /\\powershell\.exe|\\pwsh\.exe|\\wmic\.exe/ nocase and
        $event.target.process.command_line = /ClearEventLog/ nocase)) and
        $event.principal.process.file.full_path = /C:\\Windows\\SysWOW64\\msiexec.exe|C:\\Windows\\System32\\msiexec.exe/ nocase and
        $event.target.process.command_line = / sl / nocase)
    condition:
        $event
}
