rule lsass_dump_keyword_in_commandline {
    meta:
        description = "Detects the presence of the keywords \"lsass\" and \".dmp\" in the commandline, which could indicate a potential attempt to dump or create a dump of the lsass process."
        references = "https://github.com/Hackndo/lsassy, https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf, https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/credential_access_lsass_memdump_file_created.toml, https://www.whiteoaksecurity.com/blog/attacks-defenses-dumping-lsass-no-mimikatz/, https://github.com/helpsystems/nanodump, https://github.com/CCob/MirrorDump"
        mitre = "attack.credential-access, attack.t1003.001"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.command_line = /lsass\.dmp|lsass\.zip|lsass\.rar|Andrew\.dmp|Coredump\.dmp|NotLSASS\.zip|lsass_2|lsassdump|lsassdmp/ nocase or
        ($event.target.process.command_line = /lsass/ nocase and
        $event.target.process.command_line = /\.dmp/ nocase) or
        ($event.target.process.command_line = /SQLDmpr/ nocase and
        $event.target.process.command_line = /\.mdmp/ nocase) or
        ($event.target.process.command_line = /nanodump/ nocase and
        $event.target.process.command_line = /\.dmp/ nocase)))
    condition:
        $event
}
