rule potential_privilege_escalation_using_symlink_between_osk_and_cmd {
    meta:
        description = "Detects the creation of a symbolic link between 'cmd.exe' and the accessibility on-screen keyboard binary (osk.exe) using 'mklink'. This technique provides an elevated command prompt to the user from the login screen without the need to log in."
        references = "https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1546.008/T1546.008.md, https://ss64.com/nt/mklink.html"
        mitre = "attack.privilege-escalation, attack.persistence, attack.t1546.008"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.file.full_path = /\\cmd\.exe$/ nocase or
        $event.target.process.file.names = "Cmd.Exe" nocase) and
        $event.target.process.command_line = /mklink/ nocase and
        $event.target.process.command_line = /\\osk\.exe/ nocase and
        $event.target.process.command_line = /\\cmd\.exe/ nocase)
    condition:
        $event
}
