rule suspicious_new_service_creation {
    meta:
        description = "Detects creation of a new service via \"sc\" command or the powershell \"new-service\" cmdlet with suspicious binary paths"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md, https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"
        mitre = "attack.persistence, attack.privilege-escalation, attack.t1543.003"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ((($event.target.process.file.full_path = /\\sc\.exe$/ nocase and
        $event.target.process.command_line = /create/ nocase and
        $event.target.process.command_line = /binPath=/ nocase) or
        ($event.target.process.command_line = /New-Service/ nocase and
        $event.target.process.command_line = /-BinaryPathName/ nocase)) and
        $event.target.process.command_line = /powershell|mshta|wscript|cscript|svchost|dllhost|cmd |cmd\.exe \/c|cmd\.exe \/k|cmd\.exe \/r|rundll32|C:\\Users\\Public|\\Downloads\\|\\Desktop\\|\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\|C:\\Windows\\TEMP\\|\\AppData\\Local\\Temp/ nocase)
    condition:
        $event
}
