rule bypass_uac_via_cmstp {
    meta:
        description = "Detect commandline usage of Microsoft Connection Manager Profile Installer (cmstp.exe) to install specially formatted local .INF files"
        references = "https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html, https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.003/T1218.003.md, https://lolbas-project.github.io/lolbas/Binaries/Cmstp/"
        mitre = "attack.privilege-escalation, attack.defense-evasion, attack.t1548.002, attack.t1218.003"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.file.full_path = /\\\\cmstp\\.exe$/ nocase or
        $event.target.process.file.names = "CMSTP.EXE" nocase) and
        $event.target.process.command_line = /\\/s|-s|\\/au|-au|\\/ni|-ni/ nocase)
    condition:
        $event
}
