rule potential_browser_data_stealing {
    meta:
        description = "Adversaries may acquire credentials from web browsers by reading files specific to the target browser. Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future. Web browsers typically store the credentials in an encrypted format within a credential store."
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md"
        mitre = "attack.credential-access, attack.t1555.003"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.command_line = /copy-item|copy |cpi | cp |move |move-item| mi | mv / nocase or
        $event.target.process.file.full_path = /\\xcopy\.exe|\\robocopy\.exe/ nocase or
        $event.target.process.file.names = /XCOPY.EXE|robocopy.exe/ nocase) and
        $event.target.process.command_line = /\\Amigo\\User Data|\\BraveSoftware\\Brave-Browser\\User Data|\\CentBrowser\\User Data|\\Chromium\\User Data|\\CocCoc\\Browser\\User Data|\\Comodo\\Dragon\\User Data|\\Elements Browser\\User Data|\\Epic Privacy Browser\\User Data|\\Google\\Chrome Beta\\User Data|\\Google\\Chrome SxS\\User Data|\\Google\\Chrome\\User Data\\|\\Kometa\\User Data|\\Maxthon5\\Users|\\Microsoft\\Edge\\User Data|\\Mozilla\\Firefox\\Profiles|\\Nichrome\\User Data|\\Opera Software\\Opera GX Stable\\|\\Opera Software\\Opera Neon\\User Data|\\Opera Software\\Opera Stable\\|\\Orbitum\\User Data|\\QIP Surf\\User Data|\\Sputnik\\User Data|\\Torch\\User Data|\\uCozMedia\\Uran\\User Data|\\Vivaldi\\User Data/ nocase)
    condition:
        $event
}
