rule directory_removal_via_rmdir {
    meta:
        description = "Detects execution of the builtin \"rmdir\" command in order to delete directories. Adversaries may delete files left behind by the actions of their intrusion activity. Malware, tools, or other non-native files dropped or created on a system by an adversary may leave traces to indicate to what was done within a network and how. Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint."
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md, https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/erase"
        mitre = "attack.defense-evasion, attack.t1070.004"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.file.full_path = /\\cmd\.exe$/ nocase or
        $event.target.process.file.names = "Cmd.Exe" nocase) and
        $event.target.process.command_line = /rmdir/ nocase and
        $event.target.process.command_line = /\/s|\/q/ nocase)
    condition:
        $event
}
