rule suspicious_service_path_modification {
    meta:
        description = "Detects service path modification via the \"sc\" binary to a suspicious command or path"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md, https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html"
        mitre = "attack.persistence, attack.privilege-escalation, attack.t1543.003"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ($event.target.process.file.full_path = /\\sc\.exe$/ nocase and
        $event.target.process.command_line = /config/ nocase and
        $event.target.process.command_line = /binPath/ nocase and
        $event.target.process.command_line = /powershell|cmd |mshta|wscript|cscript|rundll32|svchost|dllhost|cmd\.exe \/c|cmd\.exe \/k|cmd\.exe \/r|cmd \/c|cmd \/k|cmd \/r|C:\\Users\\Public|\\Downloads\\|\\Desktop\\|\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\|C:\\Windows\\TEMP\\|\\AppData\\Local\\Temp/ nocase)
    condition:
        $event
}
