rule clear_linux_logs {
    meta:
        description = "Detects attempts to clear logs on the system. Adversaries may clear system logs to hide evidence of an intrusion"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.002/T1070.002.md"
        mitre = "attack.defense-evasion, attack.t1070.002"
        logsource = "process_creation"
        product = "linux"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ($event.target.process.file.full_path = /\/rm|\/shred|\/unlink/ nocase and
        $event.target.process.command_line = /\/var\/log|\/var\/spool\/mail/ nocase)
    condition:
        $event
}
