rule suspicious_program_names {
    meta:
        description = "Detects suspicious patterns in program names or folders that are often found in malicious samples or hacktools"
        references = "https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"
        mitre = "attack.execution, attack.t1059"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.file.full_path = /\\\\CVE-202|\\\\CVE202/ nocase or
        $event.target.process.file.full_path = /\\\\poc\\.exe|\\\\artifact\\.exe|\\\\artifact64\\.exe|\\\\artifact_protected\\.exe|\\\\artifact32\\.exe|\\\\artifact32big\\.exe|obfuscated\\.exe|obfusc\\.exe|\\\\meterpreter/ nocase) or
        $event.target.process.command_line = /inject\\.ps1|Invoke-CVE|pupy\\.ps1|payload\\.ps1|beacon\\.ps1|PowerView\\.ps1|bypass\\.ps1|obfuscated\\.ps1|obfusc\\.ps1|obfus\\.ps1|obfs\\.ps1|evil\\.ps1|MiniDogz\\.ps1|_enc\\.ps1|\\\\shell\\.ps1|\\\\rshell\\.ps1|revshell\\.ps1|\\\\av\\.ps1|\\\\av_test\\.ps1|adrecon\\.ps1|mimikatz\\.ps1|\\\\PowerUp_|powerup\\.ps1|\\\\Temp\\\\a\\.ps1|\\\\Temp\\\\p\\.ps1|\\\\Temp\\\\1\\.ps1|Hound\\.ps1|encode\\.ps1|powercat\\.ps1/ nocase)
    condition:
        $event
}
