rule potential_recon_activity_via_nltest_exe {
    meta:
        description = "Detects nltest commands that can be used for information discovery"
        references = "https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11), https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/, https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/, https://book.hacktricks.xyz/windows/basic-cmd-for-pentesters, https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/, https://eqllib.readthedocs.io/en/latest/analytics/03e231a6-74bc-467a-acb1-e5676b0fb55e.html, https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/, https://github.com/redcanaryco/atomic-red-team/blob/5360c9d9ffa3b25f6495f7a16e267b719eba2c37/atomics/T1482/T1482.md#atomic-test-2---windows---discover-domain-trusts-with-nltest"
        mitre = "attack.discovery, attack.t1016, attack.t1482"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.file.full_path = /\\nltest\.exe$/ nocase or
        $event.target.process.file.names = "nltestrk.exe" nocase) and
        (($event.target.process.command_line = /server/ nocase and
        $event.target.process.command_line = /query/ nocase) or
        $event.target.process.command_line = /\/user|all_trusts|dclist:|dnsgetdc:|domain_trusts|dsgetdc:|parentdomain|trusted_domains/ nocase))
    condition:
        $event
}
