rule rar_usage_with_password_and_compression_level {
    meta:
        description = "Detects the use of rar.exe, on the command line, to create an archive with password protection or with a specific compression level. This is pretty indicative of malicious actions."
        references = "https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/, https://ss64.com/bash/rar.html, https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md"
        mitre = "attack.collection, attack.t1560.001"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        ($event.target.process.command_line = / -hp/ nocase and
        $event.target.process.command_line = / -m| a / nocase)
    condition:
        $event
}
