rule suspicious_download_from_file_sharing_website_via_bitsadmin {
    meta:
        description = "Detects usage of bitsadmin downloading a file from a suspicious domain"
        references = "https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin, https://isc.sans.edu/diary/22264, https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/, https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker, https://www.cisa.gov/uscert/ncas/alerts/aa22-321a, https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/"
        mitre = "attack.defense-evasion, attack.persistence, attack.t1197, attack.s0190, attack.t1036.003"
        logsource = "process_creation"
        product = "windows"
    events:
        ($event.metadata.event_type = "PROCESS_LAUNCH") and
        (($event.target.process.file.full_path = /\\\\bitsadmin\\.exe$/ nocase or
        $event.target.process.file.names = "bitsadmin.exe" nocase) and
        $event.target.process.command_line = / \\/transfer | \\/create | \\/addfile / nocase and
        $event.target.process.command_line = /\\.githubusercontent\\.com|anonfiles\\.com|cdn\\.discordapp\\.com|ddns\\.net|dl\\.dropboxusercontent\\.com|ghostbin\\.co|glitch\\.me|gofile\\.io|hastebin\\.com|mediafire\\.com|mega\\.nz|onrender\\.com|pages\\.dev|paste\\.ee|pastebin\\.com|pastebin\\.pl|pastetext\\.net|privatlab\\.com|privatlab\\.net|send\\.exploit\\.in|sendspace\\.com|storage\\.googleapis\\.com|storjshare\\.io|supabase\\.co|temp\\.sh|transfer\\.sh|trycloudflare\\.com|ufile\\.io|w3spaces\\.com|workers\\.dev/ nocase)
    condition:
        $event
}
